Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPropagationTaskNotFinished
Advance Steel propagation tasks not finished.

Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPreviewTaskNotFinished
Cannot create preview while background calculations are in progress.

Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyRangesTaskNotFinished
Cannot modify ranges while background calculations are in progress.

Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyParametersTaskNotFinished
Cannot modify parameters while background calculations are in progress.